{
  "Count": 142,
  "Message": "Results returned successfully",
  "SearchCriteria": null,
  "Results": [
    {
      "DataType": "string",
      "Description": "<p>Any other battery information that does not belong to any of the fields above<\/p>",
      "ID": 1,
      "Name": "Battery Info"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Battery type field stores the battery chemistry type for anode, cathode<\/p><p>-Type for Drop-down list for battery chemistry<\/p><ul><li>Manganese Oxide Spinel\/MnO<\/li><li>Nickle-Cobalt-Aluminum\/NCA<\/li><li>Nickle-Cobalt-Manganese\/NCM<\/li><li>Cobald Dioxide\/Cobalt<\/li><li>Lithium-ion\/Li-Ion<\/li><li>Nickel-Metal-Hydride\/NiMH<\/li><li>Lead Acid\/Lead: this is normally used for the 12 volts starter battery<br><\/li><\/ul>",
      "ID": 2,
      "Name": "Battery Type"
    },
    {
      "DataType": "lookup",
      "Description": "<p>•(required field for truck and incomplete vehicle) is the cab type for both pickup truck and medium and heavy duty trucks. For pickup truck, there are mainly three types, regular cab with 2 door and 1 row of seat, Extra\/Super\/Quad\/Double\/King\/Extended cab with 2 doors and 2 row of seats, and Crew\/Super Crew\/Crew Max cab with 4 doors and 2 rows of seats. For medium and heavy duty truck, cab type is based on the relative location of the engine and cab.<\/p><p>-Cab type applies to both pickup truck and other medium and heavy duty trucks.<\/p><ul><li>For pickup trucks, the cab type is categorized by the combination number of doors and number of rows for seating;<\/li><li>For medium and heavy duty trucks, the cab type is categorized by the relative location of engine and cab.<\/li><\/ul><p>-For pickup trucks, there are 3 cab types<\/p><ul><li>Regular: 2 door, 1 row of seats<\/li><li>Extra\/Super\/Quad\/Double\/King\/Extended: 2 doors, 2 row of seats<\/li><li>Crew\/Super Crew\/Crew Max: 4 doors, 2 rows of seats<\/li><\/ul><p>-For Chrysler, a Mega Cab is crew cab<\/p><p>-For MDHD trucks there are several categories as listed below.    <\/p><ul><li>CAE: cab ahead of engine<\/li><li>CBE: cab besides engine<\/li><li>COE: cab over engine or flat nose: driver seats on top of the front axle and engine<\/li><li>LCF: low cab forward<\/li><li>Conventional: driver sits behind the engine. Most common type.<br><\/li><\/ul>",
      "ID": 4,
      "Name": "Cab Type"
    },
    {
      "DataType": "lookup",
      "Description": "<p>(required field except for truck, motorcycle and incomplete vehicle)<\/p><p>-Definition of Body Type in CFR 565<\/p><p>Body class(required field except for truck, motorcycle and incomplete vehicle) means the general configuration or shape of a vehicle distinguished by such characteristics as the number of doors or windows, cargo-carrying features and the roofline (e.g., sedan, fastback, hatchback).<\/p><p>-Drop-down list for vehicle body classes.<\/p><p>-For motorcycles, body-class is used to code type of motorcycle.<\/p><p>-Special Body Classes:<\/p><ul><li>Livery body: it’s a sedan with long wheel base such as limousine<\/li><li>Mini Cooper Hardtop &amp; Clubman - 3 Dr Shooting Brake  is Hatchback<\/li><li>Mini Cooper Countryman - 4 Dr Crossover is Hatchback<\/li><li>Mini Cooper Paceman - 2 Dr SAC is Hatchback<\/li><\/ul>",
      "ID": 5,
      "Name": "Body Class"
    },
    {
      "DataType": "int",
      "Description": "<p>-Engine number of cylinder is a numerical field to store the number of cylinders in an engine. Common values for passenger cars are 4 or 6.<\/p><p>-This is the number of cylinders in a vehicle, such as <\/p><ul><li>I4: number of cylinder is 4;<\/li><li>V6: number of cylinder is 6;<\/li><li>V8: number of cylinder is 8.<br><\/li><\/ul>",
      "ID": 9,
      "Name": "Engine Number of Cylinders"
    },
    {
      "DataType": "decimal",
      "Description": "<p>\u000d\u000a\u000d\u000a-Engine displacement  (required except for trailer) is the volume swept by all the pistons inside the cylinders of a reciprocating engine in a single movement from top dead center to bottom dead center.<\/p><p>-Most passenger car engines use liters; some motorcycle engines use cc because they are smaller engines.<\/p><p><br><\/p>",
      "ID": 11,
      "Name": "Displacement (CC)"
    },
    {
      "DataType": "decimal",
      "Description": "<p>\u000d\u000a-Engine displacement  (required except for trailer) is the volume swept by all the pistons inside the cylinders of a reciprocating engine in a single movement from top dead center to bottom dead center.<\/p><p>-Most passenger car engines use liters; some motorcycle engines use cc because they are smaller engines.<br><\/p>",
      "ID": 12,
      "Name": "Displacement (CI)"
    },
    {
      "DataType": "decimal",
      "Description": "<p>\u000d\u000a\u000d\u000a-Engine displacement  (required except for trailer) is the volume swept by all the pistons inside the cylinders of a reciprocating engine in a single movement from top dead center to bottom dead center.<\/p><p>-Most passenger car engines use liters; some motorcycle engines use cc because they are smaller engines.<br><\/p>",
      "ID": 13,
      "Name": "Displacement (L)"
    },
    {
      "DataType": "int",
      "Description": "<p>stores the number of doors<\/p>",
      "ID": 14,
      "Name": "Doors"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Drive type stores information about vehicle drivetrain configuration.  The most common drive types for passenger cars, crossover vehicles and pickup trucks are front wheel drive (FWD), rear wheel drive (RWD), all-wheel drive (AWD) and 4-wheel drive (4WD).<\/p><p>-This is normally given in the form as a x b where <\/p><ul><li>a is the number of total wheels<\/li><li>b is the number of wheels on the drive axles<\/li><li>For an example, 8x4 mean there are 4 axles and 2 drive axles, i.e. 4 wheel drive. <\/li><\/ul><p>-The most common drive types for passenger cars, MPVs and pickup trucks are<\/p><ul><li>Front Wheel Drive (FWD): this is one type of 4x2. Most entry- to mid-price level passenger cars and MPVs use this type of system, such as Toyota and Nissan brand vehicles.<\/li><li>Rear Wheel Drive(RWD): this is another type of 4x2. Most luxury passenger cars and MPVs use this type of system, such as Mercedes-Benz, BMW, Infiniti brand vehicles.<\/li><li>All-wheel drive(AWD or 4x4): this is used on passenger cars and MPVs mostly.<\/li><li>4-wheel drive (4WD or 4x4): this is used on vehicles with off-road capabilities and pickup trucks mostly.<\/li><\/ul><p>-If a submittal provides a combination that does not appear on the list, please inform your manager to decide whether a new type needs to be added to the  drop-down list.<br><\/p>",
      "ID": 15,
      "Name": "Drive Type"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\">Advanced driver-assistance systems (ADAS) are systems\u000d\u000adeveloped to automate\/adapt\/enhance vehicle systems for safety and better\u000d\u000adriving. Safety features are designed to avoid collisions and accidents by\u000d\u000aoffering technologies that alert the driver to potential problems, or to avoid\u000d\u000acollisions by implementing safeguards and taking over control of the vehicle.<o:p><\/o:p><\/p>",
      "ID": 16,
      "Name": "Driver Assist"
    },
    {
      "DataType": "int",
      "Description": "<p>\u000d\u000a\u000d\u000a\u000d\u000a-Engine stroke cycle is a numerical field for the number of strokes used by an internal combustion engine to complete a power cycle.<\/p><p>-A regular passenger car normally has a 4-stroke engine; a smaller engine, such as those for motor cycles, normally has a 2-stroke engine.<br><\/p>",
      "ID": 17,
      "Name": "Engine Stroke Cycles"
    },
    {
      "DataType": "string",
      "Description": "<p>Engine Model (required field except trailer)<\/p><p>-Engine model (required except for trailer) is a name that a manufacture applies to a family of engine.<\/p><p>-This information is usually provided in combination with other information. Please make sure to extract this information and code only the model here. <\/p><p>-Not all manufacturers provide engine model. If not provided, leave this field blank.<br><\/p>",
      "ID": 18,
      "Name": "Engine Model"
    },
    {
      "DataType": "decimal",
      "Description": "<p>-Engine net brake power  (required except for trailer) is the horsepower at the engine output shaft. <\/p><p>-Some submission label engine power as “Net Brake HP”, such as in BMW and Ford submissions. This should be coded in Engine Power.<br><\/p>",
      "ID": 21,
      "Name": "Engine Power (KW)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>defines the type of different entertainment systems in vehicles, such as CD+stereo, rear entertainment system, etc.<\/p>",
      "ID": 23,
      "Name": "Entertainment System"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Fuel type (required except for trailer) define the fuel used to power the vehicle.  For vehicles that have two power sources, such as plug-in hybrid vehicle, both primary fuel type and secondary fuel type need to be provide. <\/p><p>-For some of the natural gas engines, it is not specified whether it’s CNG or LNG. In this case, choose “Natural Gas”.<\/p><p>-For Electric vehicle, there is only primary fuel, which is electricity. <\/p><p>-For Plug-in Hybrid vehicle, the primary fuel is petroleum production, the secondary is electricity;<\/p><p>-For Strong Hybrid vehicle, there is only primary fuel, which is petroleum product.<br><\/p>",
      "ID": 24,
      "Name": "Fuel Type - Primary"
    },
    {
      "DataType": "lookup",
      "Description": "<p>(required field for MPV, Truck and LSV) is the maximum operating weight of a vehicle including the vehicle’s chassis, body, engine, engine fluids, fuel, accessories, driver, passengers and cargo, but excluding that of the trailers.<\/p><ul><li>As shown in 49 CFR 565.15, Class 1 can be further broke down to Class A-D; Class 2 can be further broke down to Class E-H.<br><\/li><\/ul>",
      "ID": 25,
      "Name": "Gross Vehicle Weight Rating"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Make (required field)<\/p><p>-Make definition from 49 CFR 565:<\/p><p>  Make (required field) is a name that a manufacturer applies to a group of vehicles or engines.<\/p><p>-Automatically populated using the information you input when you create WMI. <br><\/p>",
      "ID": 26,
      "Name": "Make"
    },
    {
      "DataType": "lookup",
      "Description": "<p>\u000d\u000a\u000d\u000aModel (required field except for Trailer and LSV)<\/p><p>-Model definition from 49 CFR 565:<\/p><p>Model (required field) means a name that a manufacturer applies to a family of vehicles of the same type, make, line, series and body type.<\/p><p>-Example of vehicle models: Honda Accord, Buick Lacrosse, Ford F-150, BMW 135i, etc<\/p><p>-Always make sure that the WMI record is linked with the Vin Schema before you code the Model information. The Model drop down is only populated when this link is established. <\/p><p>-If a particular Model doesn’t exist in the drop down, it implies that it needs to be added to the Model list in the database. Please contact your manager for adding these entries. <\/p><p>-Please make sure always code FARS Make and FARS Model with the Model element. <\/p><p>-Please see “2015 FARS-NASS GES Coding Manual 12.23.14.pdf” for FARS make, model and body type.<\/p><p>-For trailers, if there is no model, use Model = Make.<br><\/p>",
      "ID": 28,
      "Name": "Model"
    },
    {
      "DataType": "int",
      "Description": "Description for Model Year",
      "ID": 29,
      "Name": "Model Year"
    },
    {
      "DataType": "int",
      "Description": "<p>a numeric field for the number of seats in a vehicle<\/p>",
      "ID": 33,
      "Name": "Number of Seats"
    },
    {
      "DataType": "string",
      "Description": "<p>Series (required field except for Trailer, Motorcycle and LSV)<\/p><p>-Series definition from 49 CFR 565:<\/p><p>Series (required field except for Trailer, Motorcycle and LSV) means a name that a manufacturer applies to a subdivision of a ‘‘line’’ denoting price, size or weight identification and that is used by the manufacturer for marketing purposes.<\/p><p>-Example of vehicle series: Ford Expedition Eddie Bauer, Limited series.<br><\/p>",
      "ID": 34,
      "Name": "Series"
    },
    {
      "DataType": "lookup",
      "Description": "<p>defines the location of steering column, either on left (LHD) or right hand side  (RHD)<\/p>",
      "ID": 36,
      "Name": "Steering Location"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Transmission style is a field to store information about the type of transmissions. The major types of transmissions are manual transmission, automatic transmission, continuous variable transmission (CVT), dual clutch transmission (DCT). <\/p><p>-Major types are as follows<\/p><ul><li>Manual: sometimes this is marked as MT.<\/li><li>Automated Manual Transmission (AMT): this is a manual transmission with automated gear selection. It is used in some European exotic cars and some heavy duty vehicles.<\/li><li>Automatic: Sometimes it appears as ATX or AT in submittals. It is the most common type of transmission in light duty vehicles, including passenger cars, MPVs, and pickup trucks.<\/li><li>Continuous Variable Transmission (CVT): This is the CVT used in non-hybrid vehicle. Most of Nissan’s vehicles use CVT.<\/li><li>Electronic Continuously Variable (e-CVT): e-CVT transmission has a different design than the CVT above. Most of electrified vehicles, from strong hybrid to electric vehicles, use this type of transmission.<br> <\/li><\/ul>",
      "ID": 37,
      "Name": "Transmission Style"
    },
    {
      "DataType": "string",
      "Description": "<p>Trim<\/p><p>-Trim levels further identify a vehicle by a particular set of special features. Higher trim levels either will add to the features of the base (entry-level model), or replace them with something else. <\/p><p>-Trim levels are where you'll come across terms such as EX, LTZ, Touring and Grand Touring, among countless others.<br><\/p>",
      "ID": 38,
      "Name": "Trim"
    },
    {
      "DataType": "lookup",
      "Description": "This is based on the WMI",
      "ID": 39,
      "Name": "Vehicle Type"
    },
    {
      "DataType": "int",
      "Description": "<p>stores the number of windows<\/p>",
      "ID": 40,
      "Name": "Windows"
    },
    {
      "DataType": "int",
      "Description": "<p>-Axle (required field for Trailer) is the numerical value for the number of axles on a vehicle.<\/p><p>-Numerical field for the number of axles.<\/p><p>This element is not applicable to Motorcycles. Please leave it empty when coding Motorcycles<br><\/p>",
      "ID": 41,
      "Name": "Axles"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Brake system type (required field for Truck, Bus, Incomplete Vehicle and LSV) is the type of brake systems used to stop and hold the vehicle or combination of motor vehicles. The normal brake systems include hydraulic brake system, air brake system, air and hydraulic brake system.<\/p><p>- The available types are<\/p><ul><li>Air<\/li><li>Hydraulic: means a system that uses hydraulic fluid as a medium for transmitting force from a service brake control to the service brake, and that may incorporate a brake power assist unit, or a brake power unit. (FMVSS105)<\/li><li>Air &amp; Hydraulic<br><\/li><\/ul>",
      "ID": 42,
      "Name": "Brake System Type"
    },
    {
      "DataType": "int",
      "Description": "<ul><li>Number of Battery Packs per Vehicle<\/li><li>Number of Battery Modules per Pack<\/li><li>Number of Battery Cells per Module<\/li><\/ul><p>-These three fields store the information about how battery cells, packs and modules are arranged for a vehicle.<br><\/p>",
      "ID": 48,
      "Name": "Number of Battery Cells per Module"
    },
    {
      "DataType": "string",
      "Description": "<p>This is a placeholder for any\u000d\u000aother brake information.<\/p>",
      "ID": 52,
      "Name": "Brake System Description"
    },
    {
      "DataType": "int",
      "Description": "<p>Battery current field stores the\u000d\u000arange (high and low) for battery current in the unit of Amps.\u000d\u000a<\/p>",
      "ID": 57,
      "Name": "Battery Current (Amps)"
    },
    {
      "DataType": "int",
      "Description": "Battery voltage field stores the\u000d\u000arange (high and low) for battery voltage in the unit of Volts.\u000d\u000a",
      "ID": 58,
      "Name": "Battery Voltage (Volts)"
    },
    {
      "DataType": "decimal",
      "Description": "<p>Battery energy field stores the\u000d\u000arange of battery energy in the unit of kWh<\/p>",
      "ID": 59,
      "Name": "Battery Energy (KWh)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>\u000d\u000afield has values such as short, standard, long, extra long or super long. These values defines the wheel base for some passenger cars.<\/p><p>-This wheel base type should be used to decode passenger car wheel base. <\/p><ul><li>Livery body should be coded as “Long” wheel base sedan.<\/li><li>Limousine should be coded as “Long” wheel base sedan.<br><\/li><\/ul>",
      "ID": 60,
      "Name": "Wheel Base Type"
    },
    {
      "DataType": "int",
      "Description": "<p>a numeric field for number of\u000d\u000arows of seats in a vehicle.<\/p>",
      "ID": 61,
      "Name": "Number of Seat Rows"
    },
    {
      "DataType": "int",
      "Description": "<p>\u000d\u000a-Transmission speed is a numerical field for the number of speeds for a transmission, such as 6 for a six-speed automatic or manual transmission. <\/p><p>-For an example, if the submission has 6AT, this means it is a 6-speed automatic transmission.<br><\/p>",
      "ID": 63,
      "Name": "Transmission Speeds"
    },
    {
      "DataType": "lookup",
      "Description": "<p>\u000d\u000a-Engine configuration defines how engine cylinders are arranged. Common values are V6 for V-shaped arrangement, I4 or L4 for in-line arrangement.<\/p><p>-If the ORG submittal indicates “I4“or “L4” then it means “In-Line”. If the ORG indicates “V6” then it needs to be coded as “V-shaped”.<br><\/p>",
      "ID": 64,
      "Name": "Engine Configuration"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Fuel type (required except for trailer) define the fuel used to power the vehicle.  For vehicles that have two power sources, such as plug-in hybrid vehicle, both primary fuel type and secondary fuel type need to be provide. <\/p><p>-For some of the natural gas engines, it is not specified whether it’s CNG or LNG. In this case, choose “Natural Gas”.<\/p><p>-For Electric vehicle, there is only primary fuel, which is electricity. <\/p><p>-For Plug-in Hybrid vehicle, the primary fuel is petroleum production, the secondary is electricity;<\/p><p>-For Strong Hybrid vehicle, there is only primary fuel, which is petroleum product.<br><\/p>",
      "ID": 66,
      "Name": "Fuel Type - Secondary"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Fuel Delivery \/ Fuel Injection Type defines the mechanism through which Fuel is delivered to the engine. Some of the examples include  common rail direct injection for diesel, multiport fuel inject, etc.<\/p><p>-Drop-down list with fuel delivery type.<\/p><p>-If the submittal identified the Engine Type as “Gasoline Direct”, this should be coded as “Stoichiometric gasoline direct injection (SGDI)”. <\/p><p>-If the submittal has “Gasoline Port”, it should be coded as “Multipoint Port Fuel Injection”.<br><\/p>",
      "ID": 67,
      "Name": "Fuel Delivery \/ Fuel Injection Type"
    },
    {
      "DataType": "decimal",
      "Description": "<p>This field has a high and low range.<\/p><p>-Engine net brake power  (required except for trailer) is the horsepower at the engine output shaft. <\/p><p>-Some submission label engine power as “Net Brake HP”, such as in BMW and Ford submissions. This should be coded in Engine Power.<br><\/p>",
      "ID": 71,
      "Name": "Engine Brake (hp)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-EV drive unit field stores EV motor configuration for single or dual motor.<\/p>",
      "ID": 72,
      "Name": "EV Drive Unit"
    },
    {
      "DataType": "lookup",
      "Description": "<p>(required field) for the type of seat belt, such as manual or automatic.<\/p><p>-There are two type of seat belt : manual and automatic<\/p><p>-Automatic seat belt was mainly used in some old GM, Nissan and Honda vehicles.<\/p><ul><li>When the door is opened, the belts go from a fixed point in the middle of the car by the floor to retractors on the door. <\/li><li>Passengers must slide into the car under the belts. When the door closes, the seat belt retracts into the door. This system is rarely seen now.<\/li><\/ul><p>-Often we see type 2 seat belt in submissions. The following is the definition of type 1 and type 2 seat belt in 49 CFR 571.209.<\/p><ul><li>Type 1 seat belt assembly is a lap belt for pelvic restraint.<\/li><li>Type 2 seat belt assembly is a combination of pelvic and upper torso restraints. (3-point airbag)<br><\/li><\/ul>",
      "ID": 79,
      "Name": "Seat Belts Type"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\"><em>Adaptive cruise control<\/em> is similar to conventional\u000d\u000acruise control in that it maintains the vehicle's pre-set speed.&nbsp;&nbsp;\u000d\u000aHowever, unlike conventional cruise control, this new system can automatically\u000d\u000aadjust speed in order to maintain a proper distance between vehicles in the\u000d\u000asame lane. This is achieved through a radar headway sensor, digital signal\u000d\u000aprocessor and longitudinal controller. If the lead vehicle slows down, or if\u000d\u000aanother object is detected, the system sends a signal to the engine or braking\u000d\u000asystem to decelerate. Then, when the road is clear, the system will\u000d\u000are-accelerate the vehicle back to the set speed. &nbsp;<o:p><\/o:p><\/p>",
      "ID": 81,
      "Name": "Adaptive Cruise Control (ACC)"
    },
    {
      "DataType": "lookup",
      "Description": null,
      "ID": 82,
      "Name": "Adaptive Headlights"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\"><em>Antilock Brake System <\/em>or <em>ABS<\/em> means a portion\u000d\u000aof a service brake system that automatically controls the degree of rotational\u000d\u000awheel slip during braking by:<o:p><\/o:p><\/p>\u000d\u000a\u000d\u000a<p class=\"MsoNormal\">(1) Sensing the rate of angular rotation of the wheels;<o:p><\/o:p><\/p>\u000d\u000a\u000d\u000a<p class=\"MsoNormal\">(2) Transmitting signals regarding the rate of wheel angular\u000d\u000arotation to one or more controlling devices which interpret those signals and\u000d\u000agenerate responsive controlling output signals;<o:p><\/o:p><\/p>\u000d\u000a\u000d\u000a<p class=\"MsoNormal\">and<o:p><\/o:p><\/p>\u000d\u000a\u000d\u000a<p class=\"MsoNormal\">(3) Transmitting those controlling signals to one or more\u000d\u000amodulator devices which adjust brake actuating forces in response to those\u000d\u000asignals.<o:p><\/o:p><\/p>",
      "ID": 86,
      "Name": "Anti-lock Braking System (ABS)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\">Automatic emergency braking (AEB) systems detect an impending forward crash with another vehicle in time to avoid or mitigate the crash. These systems first alert the driver to take corrective action and supplements the driver’s braking to avoid the crash. If the driver brakes, but not hard enough to avoid the crash, DBS automatically supplements the driver’s braking in an effort to avoid the crash. If the driver does not take any action to avoid the crash, CIB automatically applies the vehicle’s brakes to slow or stop the car, avoiding the crash or reducing its severity.<br><\/p>",
      "ID": 87,
      "Name": "Crash Imminent Braking (CIB)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\">A <em>Blind Spot Detection (BSD)<\/em> system uses digital\u000d\u000acamera imaging technology or radar sensor technology to detect one or more\u000d\u000avehicles in either of the adjacent lanes that may not be apparent to the\u000d\u000adriver. The system warns the driver of an approaching vehicle’s presence to\u000d\u000ahelp facilitate safe lane changes.&nbsp;<o:p><\/o:p><\/p>",
      "ID": 88,
      "Name": "Blind Spot Detection (BSD)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\"><em>Electronic Stability Control (ESC<\/em>): A system that has\u000d\u000aall the following attributes: (1) That augments vehicle directional stability\u000d\u000aby applying and adjusting the vehicle brake torques individually to induce a\u000d\u000acorrecting yaw moment to a vehicle; (2) That is computer controlled with the\u000d\u000acomputer using a closed-loop algorithm to limit vehicle oversteer and to limit\u000d\u000avehicle understeer; (3) That has a means to determine the vehicle’s yaw rate\u000d\u000aand to estimate its side slip or side slip derivative with respect to time; (4)\u000d\u000aThat has a means to monitor driver steering inputs; (5) That has an algorithm\u000d\u000ato determine the need, and a means to modify engine torque, as necessary, to\u000d\u000aassist the driver in maintaining control of the vehicle, and (6) That is\u000d\u000aoperational over the full speed range of the vehicle (except at vehicle speeds\u000d\u000aless than 20 km\/h (12.4 mph), when being driven in reverse, or during system\u000d\u000ainitialization).<o:p><\/o:p><\/p>",
      "ID": 99,
      "Name": "Electronic Stability Control (ESC)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\"><em>Traction Control<\/em>: When the traction control computer\u000d\u000adetects driven wheel or wheels spinning significantly faster than another, it\u000d\u000ainvokes an electronic control unit to apply brake friction to wheels spinning\u000d\u000adue to loss of traction. This braking action on slipping wheel(s) will cause\u000d\u000apower transfer to wheel with traction due to the mechanical action within the\u000d\u000adifferential.<o:p><\/o:p><\/p>",
      "ID": 100,
      "Name": "Traction Control"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A forward collision warning (FCW) system is an advanced safety technology that monitors a vehicle’s speed, the speed of the vehicle in front of it, and the distance between the vehicles. If vehicles get too close due to the speed of the rear vehicle, the FCW system will warn that driver of an impending crash. driver and thus to prevent crashes. FCW systems provide an audible, visual, or haptic warning, or any combination thereof, to alert the driver of an FCW-equipped vehicle of a potential collision with another vehicle or vehicles in the anticipated forward pathway of the vehicle.<\/p>",
      "ID": 101,
      "Name": "Forward Collision Warning (FCW)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\">A lane departure warning (LDW) system is an advanced safety technology that alerts drivers when they unintentionally drift out of their lanes without a turn signal.<br><\/p>",
      "ID": 102,
      "Name": "Lane Departure Warning (LDW)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\">Using lane monitoring technology, lane keeping support (LKS) is an emerging safety technology that prevents drivers from unintentionally drifting out of their lanes.<\/p><p class=\"MsoNormal\">LKS systems use information provided by sensors in a lane departure warning system (LDW) system to determine whether a vehicle is about to move out of its lane of travel. If so, LKS activates by correcting the steering, braking or accelerating one or more of the wheels, or a combination of both, resulting in the vehicle returning to its intended lane of travel.<\/p>",
      "ID": 103,
      "Name": "Lane Keeping Support (LKS)"
    },
    {
      "DataType": "lookup",
      "Description": "<p class=\"MsoNormal\"><em>A rearview video system ((includes the camera and the display), also known as a backup camera, is a safety technology that helps prevent back-over crashes and protect our most vulnerable people—children and senior citizens. By providing an image of the area behind the vehicle, backup cameras help drivers see behind the vehicle.<\/em><br><\/p>",
      "ID": 104,
      "Name": "Rear Visibility System (RVS)"
    },
    {
      "DataType": "lookup",
      "Description": null,
      "ID": 105,
      "Name": "Parking Assist"
    },
    {
      "DataType": "string",
      "Description": "Used\u000d\u000afor additional information about Trim.",
      "ID": 109,
      "Name": "Trim2"
    },
    {
      "DataType": "string",
      "Description": "<p>Used\u000d\u000afor additional information about Series<\/p>",
      "ID": 110,
      "Name": "Series2"
    },
    {
      "DataType": "decimal",
      "Description": "<p>-the distance between the centers of the front and wheels<\/p><p>-High low value field<\/p><p>-If the wheel base in submission is not in inches, it needs to be converted into inches before put into vPIC, such as in Mercedes-Benz submission for Sprinter <br><\/p>",
      "ID": 111,
      "Name": "Wheel Base (inches)"
    },
    {
      "DataType": "decimal",
      "Description": "<p>-the distance between the centers of the front and wheels<\/p><p>-High low value field<\/p><p>-If the wheel base in submission is not in inches, it needs to be converted into inches before put into vPIC, such as in Mercedes-Benz submission for Sprinter <br><\/p>",
      "ID": 112,
      "Name": "Wheel Base (inches) up to"
    },
    {
      "DataType": "string",
      "Description": "<p>-This is a “catch-all” element for systems other than for engine, restraint system, brake and battery.  <\/p><ul><li>Engine, restraint system, brake and battery have their own note element.<\/li><\/ul><p>-Note is used to store any additional information that are not suitable for any of the specified fields on the interface. <br><\/p>",
      "ID": 114,
      "Name": "Note"
    },
    {
      "DataType": "int",
      "Description": "<p>-Number of wheels on a vehicle.<\/p><p>-Numerical fields for the number of wheels<br><\/p>",
      "ID": 115,
      "Name": "Number of Wheels"
    },
    {
      "DataType": "int",
      "Description": "<p>Size of front wheel in inches<\/p>",
      "ID": 119,
      "Name": "Wheel Size Front (inches)"
    },
    {
      "DataType": "int",
      "Description": "<p>Size of rear wheel in inches<\/p>",
      "ID": 120,
      "Name": "Wheel Size Rear (inches)"
    },
    {
      "DataType": "string",
      "Description": "This\u000d\u000afield is used to code any information for restraint system that does not fit\u000d\u000afor any of the fields on this tab",
      "ID": 121,
      "Name": "Other Restraint System Info"
    },
    {
      "DataType": "lookup",
      "Description": "<p>-Cooling type define the cooling system type of an engine. It can be either air cooled or water cooled.<\/p>",
      "ID": 122,
      "Name": "Cooling Type"
    },
    {
      "DataType": "decimal",
      "Description": "<p>\u000d\u000aThis field has a high and low range.<\/p><p>-Engine net brake power  (required except for trailer) is the horsepower at the engine output shaft. <\/p><p>-Some submission label engine power as “Net Brake HP”, such as in BMW and Ford submissions. This should be coded in Engine Power<br><\/p>",
      "ID": 125,
      "Name": "Engine Brake (hp) up to"
    },
    {
      "DataType": "lookup",
      "Description": "<p>\u000d\u000a-Electrification level defines to what level the vehicle is powered by electric. The common values are mild hybrid, strong hybrid, plug-in hybrid and electric vehicle.<\/p><p>-Mild Hybrid is the system such as GM BAS system which uses an electric motor to add assisting power to the internal combustion engine. <\/p><ul><li>The system has features such as stop-start, power assist and mild level of generative braking features<\/li><li>GM provide this information with their engine models.<\/li><\/ul><p>-Strong Hybrid vehicles are vehicles such as Toyota Prius which has an engine and a battery. But the only energy source added externally for this type of vehicles is petroleum product.<\/p><p>-Plug-in hybrid vehicles are vehicles such as GM Volts which has a gasoline engine and also can be charged with electricity.<\/p><p>-EVs (electric vehicles) are vehicles such as Tesla S, Nissan Leaf which has electricity as the only power source.<br><\/p>",
      "ID": 126,
      "Name": "Electrification Level"
    },
    {
      "DataType": "lookup",
      "Description": "<p>There are 3 levels of battery chargers currently. Level 1  and 2 are AC chargers; Level 3 is DC charger. Chargers at each level charges batteries with different voltage and current levels. Level 3 is the fast charging.<\/p><p>-Level 1 <\/p><ul><li>AC charger. <\/li><li>In North America this typically means 16 Amps at 120 Volts delivering 1.9 kW of power. <\/li><li>In Europe it may be 13 or 16 Amps at 240 Volts delivering 3 kW of power. <\/li><li>The EV may incorporate a standard domestic power cord to connect the vehicle to a domestic socket outlet or a Level 1 charging station.<\/li><\/ul><p>-Level 2 <\/p><ul><li>AC Charger. <\/li><li>It delivers up to 20 kW of power from either Single or Three Phase Alternating Current (AC) sources of 208-240V at up to 80Amps. <\/li><\/ul><p>-Level 3 <\/p><ul><li>DC charging, or “fast charging.” <\/li><li>To achieve very short charging times, Level 3 chargers supply very high currents of up to 400 Amps at voltages up to 600Volts DC delivering a maximum power of 240kW. <br><\/li><\/ul>",
      "ID": 127,
      "Name": "Charger Level"
    },
    {
      "DataType": "int",
      "Description": "<p>-Charger power stores the power of the charging circuit on board in the unit of kW.<\/p><p>-Tesla submits these information for their vehicles; <\/p><p>-The values for these two fields should be decided based on the description of the three levels of chargers above<br><\/p>",
      "ID": 128,
      "Name": "Charger Power (KW)"
    },
    {
      "DataType": "string",
      "Description": "<p>This\u000d\u000ais a catch-all field for other engine information that does not fit in any of\u000d\u000athe fields above.\u000d\u000a<\/p>",
      "ID": 129,
      "Name": "Other Engine Info"
    },
    {
      "DataType": "int",
      "Description": "<p>Battery current field stores the range (high and low) for battery current in the unit of Amps.<\/p>",
      "ID": 132,
      "Name": "Battery Current (Amps) up to"
    },
    {
      "DataType": "int",
      "Description": "<p>Battery voltage field stores the range (high and low) for battery voltage in the unit of Volts<\/p>",
      "ID": 133,
      "Name": "Battery Voltage (Volts) up to"
    },
    {
      "DataType": "decimal",
      "Description": "<p>Battery energy field stores the range of battery energy in the unit of kWh<\/p>",
      "ID": 134,
      "Name": "Battery Energy (KWh) up to"
    },
    {
      "DataType": "lookup",
      "Description": "<p>\u000d\u000a-Turbo is a yes\/no to field to identify whether  the engine is turbo charged or not.<\/p><p>-Yes\/no field for whether the engine is turbo-charged or not.<br><\/p>",
      "ID": 135,
      "Name": "Turbo"
    },
    {
      "DataType": "int",
      "Description": "<ul><li>Number of Battery Packs per Vehicle<\/li><li>Number of Battery Modules per Pack<\/li><li>Number of Battery Cells per Module<\/li><\/ul><p>-These three fields store the information about how battery cells, packs and modules are arranged for a vehicle.<br><\/p>",
      "ID": 137,
      "Name": "Number of Battery Modules per Pack"
    },
    {
      "DataType": "int",
      "Description": "<ul><li>Number of Battery Packs per Vehicle<\/li><li>Number of Battery Modules per Pack<\/li><li>Number of Battery Cells per Module<\/li><\/ul><p>-These three fields store the information about how battery cells, packs and modules are arranged for a vehicle<br><\/p>",
      "ID": 138,
      "Name": "Number of Battery Packs per Vehicle"
    },
    {
      "DataType": "string",
      "Description": "Suggested VIN",
      "ID": 142,
      "Name": "Suggested VIN"
    },
    {
      "DataType": "lookup",
      "Description": "Error Code",
      "ID": 143,
      "Name": "Error Code"
    },
    {
      "DataType": "string",
      "Description": "Possible Values",
      "ID": 144,
      "Name": "Possible Values"
    },
    {
      "DataType": "string",
      "Description": "Additional Error Text",
      "ID": 156,
      "Name": "Additional Error Text"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A tire-pressure monitoring system (TPMS) is an electronic system designed to monitor the air pressure inside the pneumatic tires on various types of vehicles. TPMS can be divided into two different types – direct and indirect. Direct TPMS employ pressure sensors on each wheel, either internal or external. The sensors physically measure the tire pressure in each tire and report it to the vehicle's instrument cluster or a corresponding monitor. Indirect TPMS do not use physical pressure sensors but measure air pressures by monitoring individual wheel rotational speeds and other signals available outside of the tire itself.<\/p>",
      "ID": 168,
      "Name": "TPMS"
    },
    {
      "DataType": "string",
      "Description": null,
      "ID": 169,
      "Name": "Active Safety System Note"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Dynamic brake support (DBS) is a crash avoidance technology and works as an automatic emergency braking system that detects an impending forward crash with another vehicle. The systems first alert the driver to take corrective action and supplements the driver’s braking to avoid the crash. If the driver brakes, but not hard enough to avoid the crash, DBS automatically supplements the driver’s braking in an effort to avoid the crash.<\/p>",
      "ID": 170,
      "Name": "Dynamic Brake Support (DBS)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A pedestrian automatic emergency braking (PAEB) system—also known as frontal pedestrian impact mitigation braking—is an emerging safety technology that provides automatic braking for vehicles when pedestrians are in front of the vehicle and the driver has not acted to avoid a crash.<\/p>",
      "ID": 171,
      "Name": "Pedestrian Automatic Emergency Braking (PAEB)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Auto-Reverse System enables power windows and sunroofs on motor vehicles to automatically reverse direction when such power windows and panels detect an obstruction. This feature can prevent children and others from being trapped, injured, or killed by the power windows and sunroofs.<\/p>",
      "ID": 172,
      "Name": "Auto-Reverse System for Windows and Sunroofs"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Electric vehicle warning sounds are a series of sounds designed to alert pedestrians to the presence of electric drive vehicles such as hybrid electric vehicles (HEVs), plug-in hybrid electric vehicles (PHEVs), and all-electric vehicles (EVs) travelling at low speeds. Vehicles operating in all-electric mode produce less noise than traditional combustion engine vehicles and can make it more difficult for pedestrians, the blind, cyclists, and others, to be aware of their presence.<\/p>",
      "ID": 173,
      "Name": "Automatic Pedestrian Alerting Sound (for Hybrid and EV only)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Advanced automatic collision notification (ACN) and automatic crash notification refers to a number of different systems that are capable of calling for help after an accident has occurred. The design and implementation of an ACN varies from one manufacturer to the next, but they typically make use of sensors in the vehicle to determine when an accident has occurred and the cellular phone network to call for help. Advanced Automatic Collision Notification (AACN) is the successor to Automatic Collision Notification (ACN).<\/p>",
      "ID": 174,
      "Name": "Automatic Crash Notification (CAN) \/ Advanced Automatic Crash Notification (AACN)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>An event data recorder or EDR is a device installed in automobiles to record technical vehicle and occupant information for a brief period of time (such as in seconds).<\/p>",
      "ID": 175,
      "Name": "Event Data Recorder (EDR)"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A keyless system permits starting a car without a physical key being inserted into an ignition. Instead, a small device known as a \"key fob\" transmits a code to a computer in the vehicle when the fob is within a certain close range. When the coded signal matches the code embedded in the vehicle's computer, a number of systems within the car are activated, including the starter system. This allows the car to be started by simply pressing a button on the dashboard while the key fob is left in a pocket or a purse. The vehicle is usually shut down by pushing the same button.<\/p>",
      "ID": 176,
      "Name": "Keyless Ignition"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A daytime running lamp (DRL, also daytime running light) is an automotive lighting and bicycle lighting device on the front of a roadgoing motor vehicle or bicycle, [1] automatically switched on when the vehicle is in drive, emitting white, yellow, or amber light to increase the conspicuity of the vehicle during daylight conditions.<\/p>",
      "ID": 177,
      "Name": "Daytime Running Light (DRL)"
    },
    {
      "DataType": "lookup",
      "Description": null,
      "ID": 178,
      "Name": "Lower Beam Headlamp Light Source"
    },
    {
      "DataType": "lookup",
      "Description": "<p>A semiautomatic headlamp beam switching device is one which provides either automatic or manual control of beam switching at the option of the driver. When the control is automatic, the headlamps switch from the upper beam to the lower beam when illuminated by the headlamps on an approaching car and switch back to the upper beam when the road ahead is dark. When the control is manual, the driver may obtain either beam manually regardless of the condition of lights ahead of the vehicle.<\/p>",
      "ID": 179,
      "Name": "Semiautomatic Headlamp Beam Switching"
    },
    {
      "DataType": "lookup",
      "Description": "<p>Adaptive driving beam is a type of front-lighting system that lets upper beam headlamps adapt their beam patterns to create shaded areas around oncoming and preceding vehicles to improve long-range visibility for the driver without causing discomfort, distraction, or glare to other road users.<\/p>",
      "ID": 180,
      "Name": "Adaptive Driving Beam (ADB)"
    },
    {
      "DataType": "lookup",
      "Description": null,
      "ID": 183,
      "Name": "Rear Cross Traffic Alert"
    },
    {
      "DataType": "string",
      "Description": "Error Text",
      "ID": 191,
      "Name": "Error Text"
    }
  ]
}